УНФ_ТЕСТ/src/InformationRegisters/ОчередьСообщенийИСМП/ОчередьСообщенийИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьСообщенийИСМП</name>
  <resources>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СообщениеОснование</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </resources>
  <resources>
    <name>ВидПродукции</name>
    <type>
      <types>EnumRef.ВидыПродукцииИС</types>
    </type>
  </resources>
  <resources>
    <name>Операция</name>
    <type>
      <types>EnumRef.ВидыОперацийИСМП</types>
    </type>
  </resources>
  <resources>
    <name>Назначение</name>
    <type>
      <types>EnumRef.НазначениеСообщенийИСМП</types>
    </type>
  </resources>
  <resources>
    <name>СтанцияУправленияЗаказами</name>
    <type>
      <types>CatalogRef.СтанцииУправленияЗаказамиИСМП</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </resources>
  <resources>
    <name>Документ</name>
    <type>
      <types>DefinedType.ДокументыИСМП</types>
    </type>
  </resources>
  <resources>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </resources>
  <resources>
    <name>РеквизитыИсходящегоСообщения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ПротоколОбмена</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторЗаявки</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторПоследнегоБлокаКодов</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </resources>
  <resources>
    <name>ЗагружатьПосле</name>
    <type>
      <types>CatalogRef.ИСМППрисоединенныеФайлы</types>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗагружатьДо</name>
    <type>
      <types>CatalogRef.ИСМППрисоединенныеФайлы</types>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаМодификацииУниверсальная</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Сообщение</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УНФ_ТЕСТ/src/Catalogs/ИСМППрисоединенныеФайлы/ИСМППрисоединенныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИСМППрисоединенныеФайлы</name>
  <attributes>
    <name>Автор</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <type>
      <types>DefinedType.ДокументыИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификацииУниверсальная</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата добавления файла в базу</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Зашифрован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <comment>Автор - пользователь, добавивший файл</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <comment>Индекс иконки, соответствующей расширению файла, для показа в списке</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <comment>Описание файла</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <comment>Дополнительный путь к файлу на диске (в случае если тип хранения файла - на диске)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <comment>Размер файла</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Редактирует</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИзвлеченияТекста</name>
    <type>
      <types>EnumRef.СтатусыИзвлеченияТекстаФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <comment>Текст, извлеченный из файла - для полнотекстового поиска</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипХраненияФайла</name>
    <comment>Где хранятся файлы - в базе как ХранилищеЗначения или в каталоге на диске</comment>
    <type>
      <types>EnumRef.ТипыХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Том</name>
    <comment>Ссылка на том (в случае если тип хранения файла - на диске)</comment>
    <type>
      <types>CatalogRef.ТомаХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлХранилище</name>
    <comment>Служебное поле для обмена файлами в РИБ</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.ВидыОперацийИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСообщения</name>
    <type>
      <types>EnumRef.ТипыЗапросовИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторЗапроса</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DefinedType.ДокументыИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>СообщениеОснование</name>
    <type>
      <types>CatalogRef.ИСМППрисоединенныеФайлы</types>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФорматОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбработки</name>
    <type>
      <types>EnumRef.СтатусыОбработкиСообщенийИСМП</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьВерсии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаема</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

УНФ_ТЕСТ/src/CommonForms/ЛогОбменаИСМП/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Параметры.Источник) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоИсточнику(Параметры.Источник);
	
	Если ЗначениеЗаполнено(Параметры.Заголовок) Тогда
		АвтоЗаголовок = Ложь;
		Заголовок = Параметры.Заголовок;
	КонецЕсли;
	
	СобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыЭтапыОбмена

&НаКлиенте
Процедура ЭтапыОбменаПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ЭтапыОбмена.ТекущиеДанные;
	
	Если (ТекущиеДанные = Неопределено) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстовыйДокумент.Очистить();
	ТекстовыйДокумент.ДобавитьСтроку(ТекущиеДанные.Запрос);
	ТекстовыйДокумент.ДобавитьСтроку(ТекущиеДанные.ЗапросЗаголовки);
	Если Не ПустаяСтрока(ТекущиеДанные.ЗапросТело) Тогда
		ТекстовыйДокумент.ДобавитьСтроку(ТекущиеДанные.ЗапросТело);
	КонецЕсли;
	
	ТекстовыйДокумент.ДобавитьСтроку("");
	Если Не ПустаяСтрока(ТекущиеДанные.ОтветЗаголовки) Тогда
		ТекстовыйДокумент.ДобавитьСтроку(ТекущиеДанные.ОтветЗаголовки);
	КонецЕсли;
	Если Не ПустаяСтрока(ТекущиеДанные.ОтветТело) Тогда
		ТекстовыйДокумент.ДобавитьСтроку(ТекущиеДанные.ОтветТело);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПоИсточнику(Источник)
	
	ПротоколОбмена = Неопределено;
	
	Если ТипЗнч(Источник) = Тип("Строка") Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ОчередьСообщенийИСМП.ДатаСоздания                 КАК ДатаСоздания,
		|	ОчередьСообщенийИСМП.Документ                     КАК Документ,
		|	ОчередьСообщенийИСМП.Операция                     КАК Операция,
		|	ОчередьСообщенийИСМП.ПротоколОбмена               КАК ПротоколОбмена,
		|	ОчередьСообщенийИСМП.РеквизитыИсходящегоСообщения КАК РеквизитыИсходящегоСообщения,
		|	ОчередьСообщенийИСМП.ИдентификаторЗаявки          КАК ИдентификаторЗапроса
		|ИЗ
		|	РегистрСведений.ОчередьСообщенийИСМП              КАК ОчередьСообщенийИСМП
		|ГДЕ
		|	ОчередьСообщенийИСМП.Сообщение = &Сообщение");
		Запрос.УстановитьПараметр("Сообщение", Источник);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка, "ДатаСоздания, Документ, Операция, ИдентификаторЗапроса");
			ПротоколОбмена = Выборка.ПротоколОбмена.Получить();
			
			Если ПротоколОбмена = Неопределено Тогда
				РеквизитыСообщения = Выборка.РеквизитыИсходящегоСообщения.Получить();
				
				ПротоколОбмена = Новый Массив;
				
				СтрокаПротокола = Новый Структура;
				СтрокаПротокола.Вставить("ЗапросТело",        РеквизитыСообщения.ТекстСообщенияJSON);
				СтрокаПротокола.Вставить("ОтветТело",         "");
				СтрокаПротокола.Вставить("Операция",          Выборка.Операция);
				СтрокаПротокола.Вставить("ДатаУниверсальная", Выборка.ДатаСоздания);
				
				ПротоколОбмена.Добавить(СтрокаПротокола);
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ИСМППрисоединенныеФайлы.ДатаСоздания         КАК ДатаСоздания,
		|	ИСМППрисоединенныеФайлы.Документ             КАК Документ,
		|	ИСМППрисоединенныеФайлы.Операция             КАК Операция,
		|	ИСМППрисоединенныеФайлы.Описание             КАК Ошибка,
		|	ИСМППрисоединенныеФайлы.ФорматОбмена         КАК ФорматОбмена,
		|	ИСМППрисоединенныеФайлы.ИдентификаторЗапроса КАК ИдентификаторЗапроса
		|ИЗ
		|	Справочник.ИСМППрисоединенныеФайлы КАК ИСМППрисоединенныеФайлы
		|ГДЕ
		|	ИСМППрисоединенныеФайлы.Ссылка = &Сообщение");
		
		Запрос.УстановитьПараметр("Сообщение", Источник);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка, "ДатаСоздания, Документ, Операция, ИдентификаторЗапроса");
			ПротоколОбмена = ОбщегоНазначения.ЗначениеИзСтрокиXML(
				ИнтеграцияИС.ТекстСообщенияXMLИзПротокола(Источник))
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПротоколОбмена = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		Для Каждого ЭлементДанных Из ПротоколОбмена Цикл
			
			СтрокаТЧ = ЭтапыОбмена.Добавить();
			
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, ЭлементДанных);
			СтрокаТЧ.Дата = ЭлементДанных.ДатаУниверсальная + (ТекущаяДатаСеанса() - ТекущаяУниверсальнаяДата());
			
			Если Лев(НРег(СокрЛП(ЭлементДанных.ЗапросТело)), 5) = "<?xml" Тогда
				ОбъектXDTO = ОбщегоНазначения.ОбъектXDTOИзСтрокиXML(ЭлементДанных.ЗапросТело);
				Если ОбъектXDTO <> Неопределено Тогда
					СтрокаТЧ.ЗапросТело = ИнтеграцияИСМП.ОбъектXDTOВXML(ОбъектXDTO,, Истина);
				Иначе
					СтрокаТЧ.ЗапросТело = ЭлементДанных.ЗапросТело;
				КонецЕсли;
			Иначе
				ОбъектJSON = ИнтерфейсМОТПСлужебный.ТекстJSONВОбъект(ЭлементДанных.ЗапросТело, Истина);
				Если ОбъектJSON <> Неопределено Тогда
					СтрокаТЧ.ЗапросТело = ИнтерфейсМОТПСлужебный.ОбъектВТекстJSON(ОбъектJSON);
				Иначе
					СтрокаТЧ.ЗапросТело = ЭлементДанных.ЗапросТело;
				КонецЕсли;
			КонецЕсли;
			
			ОбъектJSON = ИнтерфейсМОТПСлужебный.ТекстJSONВОбъект(ЭлементДанных.ОтветТело, Истина);
			Если ОбъектJSON <> Неопределено Тогда
				СтрокаТЧ.ОтветТело = ИнтерфейсМОТПСлужебный.ОбъектВТекстJSON(ОбъектJSON);
			Иначе
				СтрокаТЧ.ОтветТело = ЭлементДанных.ОтветТело;
			КонецЕсли;
			
		КонецЦикла;
	Исключение
		ЭтапыОбмена.Очистить();
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
